#Даны два действительных числа a и b. Получить их сумму, разность и произведение

print("Введите действительные числа")
a = float(input("a= "))
b = float(input("b= "))

Amount = a + b
Difference = a - b
Composition = a * b

print("Сумма = ", Amount)
print("Разность = ", Difference)
print("Произведение = ", Composition)

input('Нажмите ENTER для выхода') 